MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_19_02/WebRF.cpp
static String stubPage(const char* title, const char* text)
{
    String h=htmlBegin(title); h += F("<h1>"); h += title; h += F("</h1><div class='settingsBlock'><div class='blockTitle'>Раздел базового WEB-интерфейса</div><div class='note'>"); h += text; h += F("</div><p class='muted'>Внешний дисплей не выполняет функции базового модуля. При необходимости поля будут добавлены после расширения RS485-пакета.</p></div><a class='btn' href='/'>Назад</a>"); h += htmlEnd(); return h;
}

static String firmwarePage()
{
    String h = htmlBegin("Обновление программы");
    h += F("<h1>Обновление программы</h1>");
    h += F("<div class='settingsBlock'><div class='blockTitle blockTitleCenter'>Загрузка прошивки внешнего дисплея</div>");
    h += F("<form id='upload_form' method='POST' action='/update' enctype='multipart/form-data'>");
    h += F("<input id='fwFile' name='update' type='file' accept='.bin,application/octet-stream'>");
    h += F("<div class='btnRowEqual'><label class='btn' for='fwFile'>Выбрать файл .bin</label><button id='uploadBtn' class='btn danger' type='submit' disabled>Загрузить прошивку</button></div>");
    h += F("<p id='fileName' class='center muted'>Файл не выбран</p>");
    h += F("<div class='progress'><div id='bar' class='bar'></div></div>");
    h += F("<p id='st' class='center muted'>Выберите файл прошивки с расширением .bin</p>");
    h += F("</form><div class='btnRowEqual'><a class='btn' href='/'>Назад</a></div></div>");
    h += F("<script>");
    h += F("let form=document.getElementById('upload_form'),file=document.getElementById('fwFile'),btn=document.getElementById('uploadBtn'),bar=document.getElementById('bar'),st=document.getElementById('st'),fn=document.getElementById('fileName');");
    h += F("file.onchange=function(){let ok=file.files&&file.files.length>0;btn.disabled=!ok;if(ok){fn.textContent=file.files[0].name;st.textContent='Файл выбран. Нажмите Загрузить прошивку';bar.style.width='0%';}else{fn.textContent='Файл не выбран';st.textContent='Выберите файл прошивки с расширением .bin';}};");
    h += F("form.onsubmit=function(e){e.preventDefault();if(!file.files||file.files.length==0){st.textContent='Сначала выберите файл .bin';return;}btn.disabled=true;let fd=new FormData(form),x=new XMLHttpRequest();x.upload.onprogress=function(ev){if(ev.lengthComputable){let p=Math.round(ev.loaded*100/ev.total);bar.style.width=p+'%';st.textContent='Загрузка '+p+'%';}};x.onload=function(){if(x.responseText=='OK'){bar.style.width='100%';st.textContent='Обновление завершено. Перезагрузка...';}else{btn.disabled=false;st.textContent='Ошибка обновления';}};x.onerror=function(){btn.disabled=false;st.textContent='Ошибка связи при загрузке';};x.open('POST','/update');x.send(fd);};");
    h += F("</script>");
    h += htmlEnd();
    return h;
}

static String exitPage()
{
    String h;
    h.reserve(1600);
    h += F("<!DOCTYPE html><html><head><meta charset='utf-8'><meta name='viewport' content='width=device-width,initial-scale=1'><title>Выход</title>");
    h += F("<style>body{font-family:Arial,sans-serif;background:#f3f3f3;text-align:center;padding:40px 12px}.box{max-width:560px;margin:auto;background:#fff;border:1px solid #ccc;border-radius:8px;padding:24px}.btn{display:inline-block;font-size:20px;padding:12px 18px;margin:8px;border:1px solid #888;border-radius:4px;background:#eee;color:#000;text-decoration:none;cursor:pointer}</style></head><body><div class='box'>");
    h += F("<h1>WEB-интерфейс закрыт</h1><p>Точку доступа можно оставить подключённой. Эту вкладку разрешается закрыть.</p>");
    h += F("<button class='btn' onclick='window.close()'>Закрыть страницу</button><a class='btn' href='/'>Вернуться</a></div>");
    h += F("<script>setTimeout(function(){window.open('','_self');window.close();},250);</script></body></html>");
    return h;
}

static void handleRoot(){ sendNoCache(); server.send(200,"text/html; charset=utf-8",rootPage()); }
static void handleSettings(){ sendNoCache(); server.send(200,"text/html; charset=utf-8",settingsPage()); }
static void handleAbout(){ sendNoCache(); server.send(200,"text/html; charset=utf-8",stubPage("Информация","Проект внешнего TFT-дисплея. Экранная логика берется из базового модуля, данные приходят только из RS485-пакетов.")); }
static void handleFirmware(){ sendNoCache(); server.send(200,"text/html; charset=utf-8",firmwarePage()); }
static void handleExit(){ sendNoCache(); server.send(200,"text/html; charset=utf-8",exitPage()); }
static void handleCaptivePortal(){ deferDisplayUpdate(); server.sendHeader("Location","http://192.168.1.1/",true); server.send(302,"text/plain",""); }

static void handleUpdateFinished(){ sendNoCache(); server.send(200,"text/plain; charset=utf-8",(Update.hasError()||!g_updateOk)?"FAIL":"OK"); if(!Update.hasError()&&g_updateOk) scheduleReboot(4000); }
static void handleUpdateUpload()
{
    HTTPUpload& upload=server.upload();
    if(upload.status==UPLOAD_FILE_START){ g_updateOk=false; g_otaInProgress=true; g_otaWritten=0; g_otaTotal=upload.totalSize; g_updateMessage="Подготовка обновления"; uint32_t maxSketchSpace=((ESP.getFreeSketchSpace()-0x1000)&0xFFFFF000); if(!Update.begin(maxSketchSpace)){g_updateMessage="Не удалось начать обновление"; Update.printError(Serial);} }
    else if(upload.status==UPLOAD_FILE_WRITE){ if(Update.write(upload.buf,upload.currentSize)!=upload.currentSize){ g_updateOk=false; g_otaInProgress=false; g_updateMessage="Ошибка записи прошивки"; Update.printError(Serial);} else {g_otaWritten += upload.currentSize; g_updateMessage="Передача файла";} }
    else if(upload.status==UPLOAD_FILE_END){ g_otaInProgress=false; if(Update.end(true)){g_updateOk=true; g_otaWritten=g_otaTotal; g_updateMessage="Обновление завершено";} else {g_updateOk=false; g_updateMessage="Ошибка завершения обновления"; Update.printError(Serial);} }
    else if(upload.status==UPLOAD_FILE_ABORTED){ g_otaInProgress=false; g_updateOk=false; g_updateMessage="Загрузка отменена"; Update.abort(); }
    yield();
}
static void handleOtaStatus(){ String j=F("{\"in_progress\":"); j+=g_otaInProgress?F("true"):F("false"); j+=F(",\"written\":"); j+=g_otaWritten; j+=F(",\"total\":"); j+=g_otaTotal; j+=F(",\"ok\":"); j+=g_updateOk?F("true"):F("false"); j+=F(",\"message\":\""); j+=g_updateMessage; j+=F("\"}"); sendNoCache(); server.send(200,"application/json; charset=utf-8",j); }
static void handleNotFound(){ handleCaptivePortal(); }

void Web_setup()
{
    server.on("/", handleRoot);
    server.on("/settings", handleSettings);
    server.on("/settings_save", HTTP_POST, handleSettingsSave);
    server.on("/about", handleAbout);
    server.on("/firmware", handleFirmware);
    server.on("/exit", handleExit);
    server.on("/update", HTTP_POST, handleUpdateFinished, handleUpdateUpload);
    server.on("/ota_status", handleOtaStatus);
    server.on("/generate_204", HTTP_ANY, handleCaptivePortal);
    server.on("/gen_204", HTTP_ANY, handleCaptivePortal);
    server.on("/hotspot-detect.html", HTTP_ANY, handleCaptivePortal);
    server.on("/connecttest.txt", HTTP_ANY, handleCaptivePortal);
    server.on("/ncsi.txt", HTTP_ANY, handleCaptivePortal);
    server.onNotFound(handleNotFound);
    dnsServer.start(53, "*", WiFi_apIP());
    server.begin();
    Serial.println(F("[WEB] Сервер внешнего дисплея запущен"));
}
void Web_loop(){ dnsServer.processNextRequest(); server.handleClient(); if(g_rebootPending && (int32_t)(millis()-g_rebootAtMs)>=0){ g_rebootPending=false; ESP.restart(); } }
void Web_fini(){ dnsServer.stop(); server.stop(); }
bool Web_displayUpdateAllowed(){ return !g_otaInProgress && (int32_t)(millis()-g_displayUpdateNotBeforeMs)>=0; }
